Revit 2027 API
SpatialElementBoundarySubface.GetSpatialElementFace Method
 Returns the face of the spatial element's 3D geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Face GetSpatialElementFace()
Public Function GetSpatialElementFace As Face
public:
Face^ GetSpatialElementFace()
member GetSpatialElementFace : unit -> Face
Return Value
Face
 The face of the spatial element's 3D geometry.
See Also
Reference
SpatialElementBoundarySubface Class
Autodesk.Revit.DB Namespace